#ifndef FLIGHT_H_INCLUDED
#define FLIGHT_H_INCLUDED
class Flight   /// 航班
{
public :
    string num_f;///航班号
    string ftime;///起飞时间
    string fstar;///起始站
    string fend;///终点站
    int  fprice;///票价
    int  fseat;///票数

    bool setinfo();///设置航班信息
    void dis();///显示
    void refund();///退票
    bool book();///订票
    bool takeoff();///判断是否起飞
    bool deleted();///判断是否删除
};

Flight::bool deleted()
{
    cout<<"您要删除的航班为：\n"
    <<"-----------------------------------------------------\n"
	<<"| 航班号  |    起始值    |    终点站    | 起飞时间 | 票价 | 余票 |"
	<<"-----------------------------------------------------\n";
}
Flight::void dis()
{

cout<<"*************************************************\n***>>1----按航班号查询     >>2----按站点查询    >>0----返回***\n*************************************************\n请选择（0~2）："<<endl;
    cout<<"\t 航班信息表：\n"
    <<"-----------------------------------------------------\n"
	<<"|  航班号  |    起始站    |    终点站    | 起飞时间 | 票价 | 余票 |"
	<<"-----------------------------------------------------\n";

}
#endif // FLIGHT_H_INCLUDED
